app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY karma DESC LIMIT 50 OFFSET 100
SELECT COUNT(*) FROM "users"
---
  def index
    @page = params[:page]
    @users = User.paginate(:page => params[:page], :per_page => 50).order('karma DESC')